<?php

?>
<b><u>1. С помощью цикла while вывести все числа в промежутке от 0 до 100,
        которые делятся на 3 без остатка.</u></b>
<br>
Ответ:
<?php
$a = 0;
while ($a <= 100) {
    echo $a . " ";
    $a++;
}
?>
<br><br>
<b><u>2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10,
        чтобы результат выглядел так:</u></b>
<ul>
    <li>0 – ноль.</li>
    <br>
    <li>1 – нечетное число.</li>
    <br>
    <li>2 – четное число.</li>
    <br>
    <li>3 – нечетное число.</li>
    <br>
    <li>…</li>
    <br>
    <li>10 – четное число.</li>
    <br>
</ul>
<br>
Ответ:
<?php
function doWhile($x = 0)
{
    do {
        if ($x == 0)
            echo $x . ' - ' . 'ноль' . "<br>";
        elseif ($x % 2 == 0)
            echo $x . ' - ' . 'четное число' . "<br>";
        else
            echo $x . ' - ' . 'нечетное число' . "<br>";
        $x++;
    } while ($x <= 10);
}

doWhile();

?>
<br><br>
<b><u>3. Объявить массив, в котором в качестве ключей будут использоваться названия областей,
        а в качестве значений – массивы с названиями городов из соответствующей области.
        Вывести в цикле значения массива, чтобы результат был таким:</u></b>
Московская область:<br>
Москва, Зеленоград, Клин<br>
Ленинградская область:<br>
Санкт-Петербург, Всеволожск, Павловск, Кронштадт<br>
Рязанская область … (названия городов можно найти на maps.yandex.ru)<br>
<br>
Ответ:<br>
<?php
$kray = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Рязанская область" => ["Рязань", "Касимов", "Скопин", "Михайлов"]
];
foreach ($kray as $oblast => $town) {
    $str = '';
    for ($i = 0; $i < count($town); $i++) {
        if ($i == count($town) - 1)
            $str .= $town[$i];
        else
            $str .= $town[$i] . ', ';
    }
    echo (string)$oblast . ': ' . $str . '<br>';
}
?>
<br>
<b><u>4. Объявить массив, индексами которого являются буквы русского языка, а значениями –
        соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’,
        ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).<br>
        Написать функцию транслитерации строк.
    </u></b><br>
Ответ:<br>
<?php

function translit($str)
{
    $letters = [
        "а" => "a",
        "б" => "b",
        "в" => "v",
        "г" => "g",
        "д" => "d",
        "е" => "e",
        "ё" => "yo",
        "ж" => "zh",
        "з" => "z",
        "и" => "i",
        "й" => "j",
        "к" => "k",
        "л" => "l",
        "м" => "m",
        "н" => "n",
        "о" => "o",
        "п" => "p",
        "р" => "r",
        "с" => "s",
        "т" => "t",
        "у" => "u",
        "ф" => "f",
        "х" => "h",
        "ц" => "cz",
        "ч" => "ch",
        "ш" => "sh",
        "щ" => "shh",
        "ъ" => "``",
        "ы" => "y",
        "ь" => "`",
        "э" => "e`",
        "ю" => "yu",
        "я" => "ya"
    ];
    $mas = preg_split('//u', $str, null, PREG_SPLIT_NO_EMPTY);

    for ($i = 0; $i < count($mas); $i++) {
        foreach ($letters as $key => $value) {
            if ($mas[$i] == $key)
                $mas[$i] = $value;
        }
    }
    $str = implode("", $mas);

    return $str;

}

echo translit("привет World!");
?>
<br>
<b><u>5. Написать функцию, которая заменяет в строке пробелы на подчеркивания
        и возвращает видоизмененную строчку
    </u></b><br>
Ответ: <br>
<?php
function replaceString($str, $separator = " ", $replacement = "_")
{
    $mas = explode($separator, $str);
    $str = implode($replacement, $mas);
    return $str;
}

echo replaceString("Привет мир!");
?>
<br><br>
<b><u>6. В имеющемся шаблоне сайта заменить статичное меню (ul - li) на генерируемое
        через PHP. Необходимо представить пункты меню как элементы массива и вывести
        их циклом. Подумать, как можно реализовать меню с вложенными подменю?
        Попробовать его реализовать
    </u></b><br>
Ответ:<br>
<?php
     function generateMenu($menu){
         $result = "";
         $mainMenu = explode("*", $menu);
         $result .= "<ul>";
         for ($i=0; $i<count($mainMenu); $i++){
             if (strpos($mainMenu[$i], '/') !==false){
                 $subMenu = explode("/", (string)$mainMenu[$i]);
                 $result.= "<li><a href=\"#\">".(string)$subMenu[0]."</a><ul>";
                 for ($j=1; $j<count($subMenu); $j++){
                     $result .= "<li><a href=\"#\">$subMenu[$j]</a></li>";
                 }
                 $result .="</li></ul>";
             }
             else
                $result .= "<li><a href=\"#\">$mainMenu[$i]</a></li>";
         }
         $result .= "</ul>";

       // return replaceString($ul, "**", $li);
         return $result;
     }
echo generateMenu("Главная*Услуги/Ремонт/Диагностика/Замена*
    Наши работы/Проект 1/Проект 2/Проект 3*Контакты" );
?>
<br><br>
<b><u>7. *Вывести с помощью цикла for числа от 0 до 9, НЕ используя тело цикла.
        То есть выглядеть должно так<br> for (…){ // здесь пусто}<br>
    </u></b>
Ответ: <br>
<?php
    for ( $i=0; $i<=9; printf($i++)){}
?>
<br>
<br>
<b><u>8. *Повторить третье задание, но вывести на экран только города,
        начинающиеся с буквы «К».<br>
    </u></b>
Ответ: <br>
<?php
foreach ($kray as $oblast => $town) {
    $str = '';
    for ($i = 0; $i < count($town); $i++) {
        if (strpos($town[$i], 'К') !==false )
            $str .= $town[$i];
    }
    echo (string)$oblast . ': ' . $str . '<br>';
}
?>
<br>
<b><u>9. *Объединить две ранее написанные функции в одну, которая получает строку
        на русском языке, производит транслитерацию и замену пробелов на подчеркивания
        (аналогичная задача решается при конструировании url-адресов на основе названия
        статьи в блогах).<br>
    </u></b>
Ответ: <br>
<?php
function convertStringfToUrl($str)
{
    $letters = [
        "а" => "a",
        "б" => "b",
        "в" => "v",
        "г" => "g",
        "д" => "d",
        "е" => "e",
        "ё" => "yo",
        "ж" => "zh",
        "з" => "z",
        "и" => "i",
        "й" => "j",
        "к" => "k",
        "л" => "l",
        "м" => "m",
        "н" => "n",
        "о" => "o",
        "п" => "p",
        "р" => "r",
        "с" => "s",
        "т" => "t",
        "у" => "u",
        "ф" => "f",
        "х" => "h",
        "ц" => "cz",
        "ч" => "ch",
        "ш" => "sh",
        "щ" => "shh",
        "ъ" => "``",
        "ы" => "y",
        "ь" => "`",
        "э" => "e`",
        "ю" => "yu",
        "я" => "ya"
    ];
    $mas = preg_split('//u', $str, null, PREG_SPLIT_NO_EMPTY);

    for ($i = 0; $i < count($mas); $i++) {
        foreach ($letters as $key => $value) {
            if ($mas[$i]==" ")
                $mas[$i] = "_";
            if ($mas[$i] == $key)
                $mas[$i] = $value;
        }
    }
    $str = implode("", $mas);

    return $str;

}
echo convertStringfToUrl("привет World!");
?>
